（附表1 上海迪士尼乐园项目分类表）
缓速
晶彩奇航
刺激
雷鸣山漂流、古迹探索营、加勒比海盗——沉落宝藏之战、七个小矮人矿山车、抱抱龙冲天赛车、创极速光轮
水上项目
雷鸣山漂流、探险家独木舟
缓慢降落
加勒比海盗——沉落宝藏之战
极速降落
雷鸣山漂流、七个小矮人、创极速光轮
黑暗
雷鸣山漂流、加勒比海盗——沉落宝藏之战、小熊维尼历险记、小飞侠天空奇遇、创极速光轮、巴斯光年星际营救、米奇电影节
高音量
雷鸣山漂流、加勒比海盗——沉落宝藏之战
惊吓
雷鸣山漂流、古迹探索营、加勒比海盗——沉落宝藏之战
旋转
旋转木马、小飞象、喷气背包飞行器、弹簧狗团团转、胡迪牛仔嘉年华、旋转疯蜜罐
学龄前儿童
探险家独木舟、雷鸣山漂流、欢笑聚友会、探秘海妖复仇号、加勒比海盗沉落宝藏之战、船奇戏水滩、爱丽丝梦游仙境迷宫、七个小矮人矿山车、小熊维尼历险记、旋转疯蜜罐、
弹簧狗团团转、巴斯光年星际营救、太空幸会史迪奇、喷气背包飞行器、米奇俱乐部、小飞象、旋转木马、小飞侠天空奇遇、晶彩奇航、迎宾阁、漫游童话时光、古迹探险营、米奇电影节、十二朋友园、漫威英雄总部、电影放映室、雪佛兰数字挑战
儿童
所有
8-13岁少年
所有
青少年、成人
探险家独木舟、雷鸣山漂流、欢笑聚友会、翱翔·飞跃地平线、探秘海妖复仇号、加勒比海盗沉落宝藏之战、爱丽丝梦游仙境迷宫、七个小矮人矿山车、胡迪牛仔嘉年华、抱抱龙冲天赛车、弹簧狗团团转、创极速光轮、巴斯光年星际营救、太空幸会史迪奇、喷气背包飞行器、米奇俱乐部、晶彩奇航、迎宾阁、漫游童话时光、古迹探险营、米奇电影节、十二朋友园、漫威英雄总部、电影放映室、雪佛兰数字挑战
与迪士尼朋友见面
欢笑聚友会、迎宾阁、米奇俱乐部、漫威英雄总部
互动项目
欢笑聚友会、探秘海妖复仇号、船奇戏水滩、漫游童话时光、迎宾阁、米奇俱乐部、漫威英雄总部、太空幸会史迪奇、巴斯光年星际营救
室内
飞跃地平线、加勒比海盗——沉落宝藏之战、米奇电影节、米奇俱乐部、漫威英雄总部、漫游童话时光、迎宾阁、小飞侠天空奇遇、小熊维尼历险记、创极速光轮、巴斯光年星际营救、太空幸会史迪奇




COORS = {
    '与星球大战里的机器人朋友见面/星球大战远征基地/银河帝国贸易站': {'lng': 121.656853,  31.140631}, 
    '创极速光轮': {'lng': 121.656807,  31.141859},
    '雷鸣山漂流': {'lng': 121.663177,  31.143061}, 
    '古迹探索营的绳索挑战道/古迹探索营': {'lng': 121.660767,  31.143658}, 
    '古迹探索营的探索步行道/古迹探索营': {'lng': 121.660767,  31.143658}, 
    '1879 maybe 古迹探索营/古迹探索营': {'lng': 121.663918,  31.143721}, 
    '漫游童话时光': {'lng': 121.65963,  31.143789}, 
    '爱丽丝梦游仙境迷宫': {'lng': 121.659599,  31.144661}, 

    '1882 maybe 奇幻童话城堡': {'lng': 121.659691,  31.143629}, 
    '旋转疯蜜罐': {'lng': 121.65873,  31.14538},
    '奇幻童话城堡里的迪士尼公主们': {'lng': 121.660767,  31.143658},
    '小飞侠天空奇遇': {'lng': 121.657837,  31.14356}, 
    '七个小矮人矿山车': {'lng': 121.659721,  31.144939}, 
    '小熊维尼历险记': {'lng': 121.658798,  31.14563}, 
    '晶彩奇航': {'lng': 121.65844,  31.14365},
    '小飞象': {'lng': 121.659843,  31.14262}, 
    '幻想曲旋转木马': {'lng': 121.661369,  31.142611}, 
    '1900 maybe 漫威英雄总部/漫威英雄总部': {'lng': 121.658684,  31.1425}, 
    '1913 maybe 宝藏湾的杰克船长': {'lng': 121.660767,  31.143658},
    '探险家独木舟': {'lng': 121.662148,  31.143789}, 
    '加勒比海盗——沉落宝藏之战': {'lng': 121.66172,  31.145241}, 
    '传奇戏水滩': {'lng': 121.66198,  31.14502}, 
    '探秘海妖复仇号': {'lng': 121.662781,  31.14517},
    '巴斯光年星际营救': {'lng': 121.6577,  31.14135}, 
    '喷气背包飞行器': {'lng': 121.660767,  31.143658}, 
    '太空幸会史迪奇': {'lng': 121.660767,  31.143658}, 
    '1905 is Closed': {'lng': 121.660767,  31.143658},
    '翱翔.飞跃地平线': {'lng': 121.660767,  31.143658}, 
    '奇想花园的米奇俱乐部': {'lng': 121.659218,  31.142441}, 
    '漫威英雄总部的美国队长/漫威英雄总部': {'lng': 121.658684,  31.1425}, 
    '欢笑聚友会的丛林迪士尼朋友们': {'lng': 121.664207,  31.14418}, 
    'CampDiscovery': {'lng': 121.660767,  31.143658},
    '米奇电影节': {'lng': 121.660767,  31.143658},
    'TronRealm maybe 米妮和朋友们': {'lng': 121.660767,  31.143658}, 
    '星球大战远征基地/星球大战远征基地/银河帝国贸易站': {'lng': 121.656853,  31.140631},
    'MarvelUniverse maybe 十二朋友园': {'lng': 121.660957,  31.143},
    '2596 is Closed': {'lng': 121.660767,  31.143658}, 
    '漫威英雄总部的蜘蛛侠/漫威英雄总部': {'lng': 121.658913,  31.142481}, 
    '变身钢铁侠/漫威英雄总部': {'lng': 121.658684,  31.1425},
    '电影放映室/星球大战远征基地/银河帝国贸易站': {'lng': 121.656853,  31.140631}, 
    '星球大战远征基地的凯洛.伦/星球大战远征基地/银河帝国贸易站': {'lng': 121.656853,  31.140631}, 
    '星球大战远征基地的达斯.维达/星球大战远征基地/银河帝国贸易站': {'lng': 121.656853,  31.140631},
    '千年隼号/星球大战远征基地/银河帝国贸易站': {'lng': 121.656853,  31.140631}, 
    '抱抱龙冲天赛车': {'lng': 121.656548,  31.143299},
    '弹簧狗团团转': {'lng': 121.660767,  31.143658}, 
    '胡迪牛仔嘉年华': {'lng': 121.657333,  31.144051}
    }